#  list cuts and comparing of lists
cities = ["Kyiv", "Lviv", "Dnipro"]
lst = cities[:]  # Make a copy of cities
lst2 = list(cities)  # Also make a copy
print(cities, lst, lst2)

d = cities  # NOT a copy, but refference on the same list
print(id(cities), id(d))

marks = [8, 9, 12, 10, 11, 10]
print(marks[1:-1])  # from 1 to -2
print(marks[-3:-1])  # from -3 to -4 срезы списков
print(marks[1:-1: 2])  # from 1 to -1 woth step 2
print(marks[::-1])  # reverse list
marks[2:4] = ["good", "excelent"]  # replace 2nd and 3rd value with new ones
print(marks)
marks[2:4] = [12, 10]
print(marks)
marks += [3]  # add new element in the end of the list
marks[:-1:2] = [0, 0, 0]  # group assingment
print(marks)
print([1, 2, 3] == [1, 2, 3])  # list comparison
print([1, 0, 3] > [1, 2, 3])  # list comparison
print([1, -2, 3] <= [1, 2, 3])  # list comparison
print([1, 2, 3, 4] > [1, 2, 3])  # list comparison
print([1, 2, "ABC"] > [1, 2, "ABC"])  # list comparison
print([1, 2, "3"] == [1, 2, 3])  # list comparison. PYTHON can't compare (>, <) lists like this
#######################################################################
# Имеется список числа просмотров видео по дням:
# v = [1205, 1101, 1434, 1320, 923, 874]
# Необходимо выбрать из него первые три значения (используя срезы)
# и вывести результат на экран.

v = [1205, 1101, 1434, 1320, 923, 874]
print(v[:3])

#  Имеется список числа просмотров видео по дням:
# v = [1205, 1101, 1434, 1320, 923, 874]
# Необходимо выбрать из него последние четыре значения (используя срезы)
# и вывести результат на экран.
v = [1205, 1101, 1434, 1320, 923, 874]
print(v[-4:])

#  Имеется список городов:
# c = ["Москва", "Ульяновск", "Самара", "Тверь", "Вологда", "Омск", "Уфа"]
# Необходимо с помощью срезов выбрать из него города через один (начиная с первого)
# и результат вывести на экран.
c = ["Москва", "Ульяновск", "Самара", "Тверь", "Вологда", "Омск", "Уфа"]
print(c[::2])

#  Имеется список городов:
# c = ["Москва", "Ульяновск", "Самара", "Тверь", "Вологда", "Омск", "Уфа"]
# Необходимо с помощью срезов выбрать из него города через один (начиная со 2-го)
# и результат вывести на экран.
c = ["Москва", "Ульяновск", "Самара", "Тверь", "Вологда", "Омск", "Уфа"]
print(c[1::2])

# Имеется список с оценками студента:
# m = [2, 3, 5, 5, 2, 2, 3, 3, 4, 5, 4, 4]
# Необходимо с помощью срезов выбрать элементы с 3-го по 7-й (включительно)
# и вывести их на экран в обратном порядке.
m = [2, 3, 5, 5, 2, 2, 3, 3, 4, 5, 4, 4]
m = m[2:7]
print(m[::-1])
# Необходимо с помощью срезов выбрать элементы через один, начиная с последнего,
# и вывести результат на экран.
m = [2, 3, 5, 5, 2, 2, 3, 3, 4, 5, 4, 4]
print(m[::-2])