# Установка сторонних модулей (pip install). Пакетная установка
# numPy - работа с многомерными массивами
# matplotlib - отображение графиков
# pygame - простая 2Д графика
# flask - простой фреймворк (часто для информационных сайтов)
# django - продвинутый фреймворк для самых сложных сайтов
# pip list - список всех сторонних пакетов, установленных
# для текущего пакета
# install pygame
# install flask==1.1.2
# Репозиторий сторонних модулей: https://pypi.org
# pip install -r <текстовый файл> - установка пакетов из списка
# pip freeze > requirements.txt - запись списка установленных пакетов в файл
#
#
#
#
import sys
print(sys.path)  # последний путь - путь, по которому устанавливаются
# пакеты
